&НаКлиенте
Процедура УстановитьФлаг(Команда)
	ИзменитьФлаг(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлаг(Команда)
	ИзменитьФлаг(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФлаг(Флаг)
	
	Для Каждого Строка Из ТаблицаРеестра Цикл
		Строка.Флаг = Флаг;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Организация КАК Организация,
		|	МАКСИМУМ(ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.ДатаОткрытияЛицевогоСчета) КАК ДатаОткрытияЛицевогоСчета
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам КАК ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам
		|ГДЕ
		|	ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Организация = &Организация
		|	&ОтборПоФизЛицу1
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.ФизическоеЛицо,
		|	ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.ЗарплатныйПроект КАК ЗарплатныйПроект,
		|	ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Организация КАК Организация
		|ПОМЕСТИТЬ ВТЗарплатныйПроект
		|ИЗ
		|	ВТ КАК ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам КАК ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам
		|		ПО ВТ.ФизическоеЛицо = ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.ФизическоеЛицо
		|			И ВТ.Организация = ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Организация
		|			И ВТ.ДатаОткрытияЛицевогоСчета = ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.ДатаОткрытияЛицевогоСчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИСТИНА КАК Флаг,
		|	ВзаиморасчетыСДепонентами.ФизическоеЛицо КАК Сотрудник,
		|	ВЫРАЗИТЬ(ВзаиморасчетыСДепонентами.Регистратор КАК Документ.ВыплатаДепонированнойЗарплаты)КАК Документ,
		|	ВзаиморасчетыСДепонентами.Сумма КАК Сумма,
		|	ВТЗарплатныйПроект.ЗарплатныйПроект КАК ЗарплатныйПроект
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСДепонентами КАК ВзаиморасчетыСДепонентами
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗарплатныйПроект КАК ВТЗарплатныйПроект
		|		ПО ВзаиморасчетыСДепонентами.ФизическоеЛицо = ВТЗарплатныйПроект.ФизическоеЛицо
		|			И ВзаиморасчетыСДепонентами.Организация = ВТЗарплатныйПроект.Организация
		|ГДЕ
		|	ВзаиморасчетыСДепонентами.Активность
		|	И ВзаиморасчетыСДепонентами.Организация = &Организация
		|	И ВЫРАЗИТЬ(ВзаиморасчетыСДепонентами.Регистратор КАК Документ.ВыплатаДепонированнойЗарплаты).Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ВзаиморасчетыСДепонентами.Регистратор ССЫЛКА Документ.ВыплатаДепонированнойЗарплаты
		|	&ОтборПоФизЛицу2
		|	&ОтборПоЗарплатномуПроекту";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ФизическоеЛицо", Сотрудник);
	Запрос.УстановитьПараметр("ЗарплатныйПроект", ЗарплатныйПроект);
	
	Если НЕ ЗначениеЗаполнено(ЗарплатныйПроект) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоЗарплатномуПроекту", "");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоЗарплатномуПроекту",
		"И ВТЗарплатныйПроект.ЗарплатныйПроект = &ЗарплатныйПроект");
	КонецЕсли;
	
	Если Сотрудник.Количество() = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоФизЛицу1", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоФизЛицу2", "");
		
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоФизЛицу1",
		"И ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.ФизическоеЛицо В(&ФизическоеЛицо)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоФизЛицу2",
		"И ВзаиморасчетыСДепонентами.ФизическоеЛицо В(&ФизическоеЛицо)");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ТаблицаРеестра.Очистить();
	ТаблицаРеестра.Загрузить(РезультатЗапроса.Выгрузить());
	//dev1
	//dev2
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	Если ПроверитьЗаполнение() Тогда
		ЗаполнитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьФайлНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФайл(Команда)
	ВыгрузитьФайлНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодНачисления(Команда)
	
	Контекст = Новый Структура();
	Обработчик = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект, Контекст);
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	
	Период = Новый СтандартныйПериод;
	Период.ДатаНачала = НачалоПериода;
	Период.ДатаОкончания = КонецПериода;
	
	Диалог.Период = Период;
	Диалог.Показать(Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, Контекст) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		НачалоПериода = РезультатВыбора.ДатаНачала;
		КонецПериода = РезультатВыбора.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьККаталогуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытия.Каталог = "";
	ДиалогОткрытия.МножественныйВыбор = Ложь;
	ДиалогОткрытия.Заголовок = "Выберите каталог";
	
	Если ДиалогОткрытия.Выбрать() Тогда
		ПутьККаталогу = ДиалогОткрытия.Каталог;
	КонецЕсли;
	
КонецПроцедуры